[
  {
    "id": 1,
    "date": "2003-02-06",
    "entry": [
      "Just a quick note to tell you all that I'll change the poll whenever I get to college today, as well as the update for January 2003. Yes that's right it's February already. Ive also updated the links section. It's getting a bit scarce.",
      "Dave from pixel Masher also e-mailed me about his Space Hopper Star Wars parody site which was already mentioned on GalacticEmpire.co.uk."
    ]
  },
  {
    "id": 2,
    "date": "2003-01-23",
    "entry": [
      "I've had an email from one of the webmasters from DewbackWing Europe, he says thFat there is a section of their forum set up specifically for Irish people. DewbackWing are mainly concerned with creating props and costumes from Star Wars but they also have some RPG areas of the site. Check out the site here.",
      "As you know the Trivia competition has finished for a while again. Now I'm wondering, when I start the trivia competition again, should I start the Trivia Table from scratch again or should it be continued on from the last one? Or should I create a trivia table for the first five, the last five and the next five trivia competitions? Seeing as ye are the ones who participate in the Trivia competitions you should have your input on the subject. Just send us an e-mail.",
      "In other news my other web-site, PaddyFedoo ONLINE, (link may no longer be accessable) is having a bit of trouble. ProHosting who host the site are trying to make me pay for it and while it must be said it is a low enough sum I'm just not prepared to pay for the service which is at best, crap. So if you know of any FREE hosting sites out there with FTP support, let us know."
    ]
  },
  {
    "id": 3,
    "date": "2002-12-03",
    "entry": [
      "I have a few more scanned articles this week. One is an advert for Episode I which has its 'Premiere' on UTV tonight, even though it has already been on RTÉ. Anyway read it <a href=\"rteguide_epiguide.jpg\" onclick=\"showImage('rteguide_epiguide.jpg','Episode I article'); return false;\">here</a> with the photo <a href=\"rteguide_quigonpic.jpg\" onclick=\"showImage('rteguide_quigonpic.jpg','Qui-Gon Jinn picture'); return false;\">here</a>.",
      "The second scan is of a USI (Union of Students in Ireland) leaflet for this years 'Grant' marches. It likens the Irish Government to the 'Evil Empire'. The full size poster in the college is quite funny also. Click <a href=\"usi_poster.jpg\" onclick=\"showImage('usi_poster.jpg','USI Leaflet'); return false;\">here</a> to see the leaflet.",
      "The archives for November 2002 have been added."
    ]
  },
  {
    "id": 4,
    "date": "2003-01-02",
    "entry": [
      "I know, I know I've been idle on the site for a month and I'm sorry about that. Things just kept getting in the way. Any way belated Merry Christmas and Happy 2003 to you all. I hope you all had a good one and looking forward to another Star Wars packed year.",
      "In terms of the site, not much has happened. The trivia contest is over and Gabe has won again, however without anyone else entering. Still nevermind. I think I'll take a small break from the trivia for a while. It'll give me a bit of time to gather some more questions. Rest assured it will be back and quicker than the last break. There's also something important I need to ask you (ie those who participate in the trivia). More about that later though."
    ]
  }
]
